ref(post): convert ascii to mermaid diagram
